[
  {
    "id": 2,
    "extendedDescription": "About this item:\n\nIntroducing 2-year filter life: Save up to ₹13,500 on total ownership and service costs over 6 years with smart rinse technology that needs no service for 2 years. Actual results may vary based on water input.\n\n10-Stage Purifier: Aqua purification comprises 10 crucial stages, including UV, a copper-charged filter, and providing water enriched with alkaline and essential minerals. US FDA certified 99.99% pure water\n2-year unconditional warranty: All filters, membranes, & electrical parts changes covered at zero service cost. Avail warranty in one-click from the Urban Company app\n\nIn-tank UV: Enhances water safety with continuous UV light in the tank, eliminating germs, bacteria, and viruses for 24X7 protection against infections providing mineral-enriched, pure, and safe RO water\nNative UC free installation is available in these cities: Agra, Ahmedabad, Aurangabad, Bangalore, Bhopal, Bhubaneswar, Chennai, Dehradun, Delhi-NCR, Guntur, Guwahati, Gwalior, Hyderabad, Indore, Jabalpur, Jaipur, Jamshedpur, Kanpur, Karnal, Kochi, Kolkata, Kota, Lucknow, Ludhiana, Madurai, Mumbai, Mysore, Nagpur, Nashik, Patna, Panipat, Prayagraj, Pune, Raipur, Rajahmundry, Ranchi, Surat, Thiruvananthapuram, Vadodara, Varanasi, Vijayawada, Visakhapatnam, and Warangal.\n\nFree installation by Urban Company at your preferred date and time. In high-rise buildings where input pressure exceeds 30 PSI, a pressure-reducing valve will be installed at an additional cost of ~₹250. In low rise building and independent houses where input pressure is below 5 PSI, a Pressure Enhancing Kit will be installed at an additional cost up to ~₹500\n\nIdeal for all water sources: Tanker, borewell, municipal and tap water\n8-liter storage: 8 L food-grade tank that keeps the water mineral-enriched and free from harmful chemicals, making it fit for consumption. Suitable for home & office\n\nBox contents: Water Purifier, Pre-filter, installation kit, digital user manual & warranty card",
    "specifications": [
      {
        "name": "Brand:",
        "value": "Native by UC"
      },
      {
        "name": "Special Feature:",
        "value": "Needs no service for 2 years"
      },
      {
        "name": "Product Dimensions:",
        "value": "33.5L x 25.2W x 62.2H Centimeters"
      },
      {
        "name": "Package Information:",
        "value": "Dispenser"
      },
      {
        "name": "Installation Type:",
        "value": "Wall Mount"
      },
      {
        "name": "Material:",
        "value": "Polypropylene"
      },
      {
        "name": "Capacity:",
        "value": "8 liters"
      },
      {
        "name": "Purification Method:",
        "value": "10 Stage Purifier - RO+UV boosted with Copper, Minerals & Alkaline"
      }
    ]
  }
]