[
  {
    "id": 1,
    "name": "realme Narzo 60 Pro 5G",
    "brand": "Realme Narzo",
    "price": "₹24,999",
    "category": "smartphones",
    "description": "The Realme Narzo 60 Pro 5G flaunts a 6.7-inch AMOLED display with a 120Hz refresh rate.",
    "image": "images/realmenarzo60pro.jpg",
    "rating": 4.8
  },
  {
    "id": 2,
    "name": "Native by UC Urban Company M1 Water Purifier",
    "brand": "Native by UC",
    "price": "₹13,999",
    "category": "accessories",
    "description": "Native by UC Urban Company M1 Water Purifier | Needs No Service For 2 Years | RO+UV+Copper+Alkaline | 10-Stage Purifier | 4-in-1 Health Booster | 8L Capacity | 2 Year Warranty (Filters Included)",
    "image": "KJB",
    "rating": 4.5
  },
  {
    "id": 3,
    "name": "ZEBRONICS Dolphin Silent Wireless Mouse",
    "brand": "ZEBRONICS",
    "price": " ₹699",
    "category": "laptops",
    "description": "ZEBRONICS Dolphin Silent Wireless Mouse, Dual Mode Bluetooth, 2.4 GHz, 1200 DPI, 3 Buttons, USB Nano Receiver, Thumb Scroll Wheel, Glossy Finish and Ergonomic Design (White)",
    "image": "dxsx",
    "rating": 4
  },
  {
    "id": 4,
    "name": "Pureit Wave Prime Mineral RO+MF | 6 stage Purification | 7 Litres Capacity | Up to 45% Water Saving | Suitable for Borewell, Tanker & Muncipal Water | Wall Mountable | Black",
    "brand": "Pureit",
    "price": "₹6,799",
    "category": "accessories",
    "description": "Presenting the new Wave Prime that is WQA tested for family safety.\nThe mineral enhancer cartridge enriches your water with essential minerals like calcium & magnesium, providing you with 100% RO water without bypass.\niSF (Internal Sediment Filter) that lasts 2x longer.\nSmartSense indicators alert you 15 days before filter expiry and suspend water dispensing if the filter is not changed, ensuring you receive mineral-enriched, safe RO water.\nHighest storage capacity of 7 liters, so that you & your family never run out of fresh & safe RO water.\nLonger filter life of 6000 liters, which is double compared to ordinary ROs.\nPurifies all types of drinking water: borewell, tanker & tap water.\nOther features: High-speed purification up to 20 LPH, 6-stage purification, 100% food-grade plastic, premium design and aesthetics, and 24x7 WhatsApp assistance.\nColor: Black, Capacity: Up to 7 liters, Power: 36 watts, Input Water Temperature: 10 degrees Celsius to 40 degrees Celsius, Operative Input Voltage: 100-240 V a.c. 50/60 Hz (Device can withstand voltage fluctuation from 100 to 300 V a.c.).\nProduct Dimensions: Length 27.4 cm X Width 32.5 cm X Height 38 cm; Pack inclusions: Water purifier, installation kit, warranty card & handheld TDS meter. Excluded in the box: Booster pump, pressure reducing valve, and an iron cartridge (these are based on pressure conditions and to be purchased at the time of installation). Please refer to the device manual for detailed disclaimers/terms & conditions.\n",
    "image": "KJB",
    "rating": 4.7
  }
]