[
  {
    "id": "1",
    "image": "images/Moratala.png",
    "company": "Motorola Solutions",
    "title": "Motorola Solutions Off Campus Drive 2025: Hiring Junior Devops Engineer Recruitment services",
    "description": " Motorola Solutions Off Campus Drive 2025 hiring Junior Devops Engineer of Degree in  Computer Science, Engineering, Information Technology, or a related field to work at Bangalore location. The detailed eligibility and application process are given below.",
    "fullDescription": "Company Website: www.motorolasolutions.com\n\nJob Role: Junior Devops Engineer\n\nQualification: Bachelors's Degree\n\nExperience: Freshers\n\nBatch: 2021/2022/2023/2024\n\nSalary: 10 LPA (Expected)\n\nJob Location: Bengaluru\n\n\nLast Date: ASAP\n\nAbout the job\nCompany Overview\n\nAt Motorola Solutions, we're guided by a shared purpose - helping people be their best in the moments that matter - and we live up to our purpose every day by solving for safer. Because people can only be their best when they not only feel safe, but are safe. We're solving for safer by building the best possible technologies across every part of our safety and security ecosystem. That's mission -critical communications devices and networks, AI-powered video security & access control and the ability to unite voice, video and data in a single command center view. We're solving for safer by connecting public safety agencies and enterprises, enabling the collaboration that's critical to connect those in need with those who can help. The work we do here matters.\n\nDepartment Overview\n\nThe Junior DevOps Engineer will be an integral member of the IT operations team, working closely with Cloud Operations, development, QA, and IT teams to facilitate the smooth deployment and operation of infrastructure, on-prem and software. The role involves learning and assisting with the automation of the software delivery process, ensuring scalable and efficient development cycles, and maintaining the infrastructure necessary for optimal system performance.\n\nJob Description\n\n Assist in the set up and maintenance of continuous integration (CI) and continuous deployment (CD) pipelines for various development projects. \n Help manage version control systems like Git and coordinate code merges and deployments. \n Work with containerization and orchestration tools (e.g., Docker, Kubernetes) under the guidance of senior team members. \n Participate in the monitoring and reporting of cloud and on-premises infrastructure using tools like Nagios, Grafana, or AWS CloudWatch. \n Contribute to the development of automation scripts and tools to streamline operational tasks. \n Collaborate with the development team to troubleshoot and resolve build or deployment issues. \n Learn and follow best practices in system administration, security, and code deployment. \n Participate in the creation and maintenance of system documentation and standard operating procedures. \n Assist in the evaluation of new technologies and tools and contribute to the continuous improvement of the deployment process. \n Support the team in managing virtual servers, databases, and other resources in the cloud or on-premises environments. \n\nBasic Requirements\n\nDegree in Computer Science, Engineering, Information Technology, or a related field. \nFamiliarity with software development lifecycle and basic principles of agile methodologies. \nUnderstanding of basic system administration (Linux/Windows), network protocols, and services. \nExposure to scripting languages such as Bash, Python, Perl, or similar. \nBasic knowledge of automation tools (e.g., Jenkins, Ansible, Puppet, Chef) is a plus. \nAn eagerness to learn and work with various technologies and tools. \nStrong analytical and problem-solving skills. \nExcellent verbal and written communication skills. \nAbility to work in a team environment and contribute to collaborative team efforts. \n\nTravel Requirements\n\nNone\n\nRelocation Provided\n\nNone\n\nPosition Type\n\nNew Grad\n\nReferral Payment Plan\n\nNo\n\nEEO Statement\n\nMotorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.\n\nWe are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If youd like to join our team but feel that you dont quite meet all of the preferred skills, we'd still love to hear why you think you'd be a great addition to our team.\n\nWe are committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please email ohr@motorolasolutions.com.",
    "applyLink": "https://www.linkedin.com/jobs/view/4102062003/",
    "postingDate": "2025-04-03"
  },
  {
    "id": "2",
    "company": "BROWSERSTACK",
    "title": "Software Engineer (Backend)-Mumbai",
    "description": "At BrowserStack we’re building the testing infrastructure for the world. We’re extremely curious, passionate, and customer-obsessed about our mission of empowering developers to build amazing experiences.  We know we’ll grow only when our people grow—so we build teams that are open, transparent, collaborative, and above all supportive.  We’re remote-first and our people have the choice to work from anywhere—it’s our core values that bring us all together and drive everything we do.  We’re thinkers, movers, innovators, and doers who believe no feat is too big to achieve. We strive to deliver awesome results, fast; and in that way, we’re a lot like you.",
    "fullDescription": "Who are we, and what do we do?\n\nBrowserStack is the world’s leading cloud-based software testing platform, empowering over 50,000 customers—including Amazon, Microsoft, Meta, and Google—to deliver high-quality software at speed. Founded in 2011 by Ritesh Arora and Nakul Aggarwal, the company has grown to support more than two million tests daily across 21 global data centers, providing instant access to 35,000+ real devices and browsers.\n\nWith over 1,200 employees and a remote-first approach, BrowserStack operates at the intersection of scale, reliability, and innovation. Its suite of products spans manual and automated testing, visual regression, accessibility, and test management—all designed to simplify the testing process for modern development teams. Behind the scenes, BrowserStack continues to push the boundaries with AI capabilities like smart test case generation and design, flakiness detection, auto-healing, and more—helping teams reduce maintenance overhead, debug faster, and catch issues earlier in the development lifecycle.\n\nRecognized for its innovation and growth, BrowserStack has been named to the Forbes Cloud 100 list for four consecutive years. With backing from investors like Accel, Bond, and Insight Partners, the company continues to expand its product offerings and global footprint. Joining BrowserStack means being part of a mission-driven team dedicated to shaping the future of software testing.\n\nRole in a nutshell:\n\nYou will design, develop, document, and support systems and applications that are used by a large number of developers. You will work in an agile engineering team and will plan and execute technical projects that will support business requirements. You will collaborate with engineers across teams to build, review, and deliver scalable solutions for different use cases.\n\nLocation (Remote): This position requires candidates based in Mumbai or willing to relocate to Mumbai only.\n\nDesired experience:\n\nSoftware development or programming experience of 0-1 years \n\nof experience.\n\nExtensive experience with at least one language: Ruby, Node.js, Python, Java, or C/C++.\n\nGood knowledge of operating systems, databases, and networking concepts\n\nAbility to work on Windows and Linux platforms below the application layer, including file systems, kernels, custom installations, scripting, internal APIs, etc.\n\nAbility to communicate effectively with employees in the company in both technical and non-technical roles\n\nAggressive problem diagnosis and solving real-world problems effectively.\n\nShould have a startup mentality, high willingness to learn, and be hardworking and able to work in a fast-paced environment.\n\n\nWhat will you do?\n\nYou will design and develop systems and applications with agility and quality at scale.\n\nYou will take responsibility for end-to-end ownership of tasks from development to production.\n\nAlso will help with the design, implementation, and launch of many key product features. \n\nParticipate in a culture of code reviews and collaborating closely with other engineers\n\nDrive best practices and engineering improvements\n\nFind solutions and solve issues around a variety of operating systems or programming languages\n\nBenefits:\n\nIn addition to your total compensation, you will be eligible for the following benefits, which will be governed by the company policy:\n\nMedical insurance for self, spouse, to 2 dependent children, and Parents or Parents-in-law up to INR 500,000\n\nGratuity as per payment of Gratuity Act, 1972\n\nUnlimited Time Off to ensure our people invest in their well-being, to rest and rejuvenate, and to spend quality time with family and friends\n\nRemote-First work environment in India\n\nRemote-First Benefit for home office setup, connectivity, accessories, co-working spaces, well-being to ensure an amazing remote work experience",
    "image": "images/zeotap.pngskjxnhf",
    "applyLink": "https://browserstack.wd3.myworkdayjobs.com/External/job/Mumbai-Remote/Software-Engineer--Backend--Mumbai_JR102378",
    "postingDate": "2025-04-29"
  },
  {
    "id": "3",
    "image": "images/S&P.png",
    "company": "S&P Global",
    "title": "S&P Global Off Campus Drive 2025: Hiring Engineer I, Software Development Recruitment servicesSoftwa",
    "description": "S&P Global Off Campus Drive 2025: hiring freshers for the role of Engineer I,  Software Development. Freshers (2024 graduates preferred) are eligible to apply. The detailed eligibility and application process are given below.",
    "fullDescription": "Company Website: www.spglobal.com\n\nJob Role: Engineer I, Software Development\n\nQualification: Bachelor's/Master's degree\n\nBatch: 20222/2023/2024/2025\n\nExperience : Freshers\n\nSalary: 5 to 8 (Via Glassdoor)\n\nJob Location: Bangalore\n\nLast Date: ASAP\n\nAbout the Role:\nThe Team:\nThe S&P WSO (Wall Street Office) is the industry leader in leveraged loan and high-yield solutions, providing comprehensive products and services for portfolio management, servicing, reporting, and analysis. Our portfolio management solution gives immediate access to real-time reference and transactional data on various asset classes. Its functionality is tailored to handle the unique behavior of bank loans and compliance reporting required for complex structures.\n\nWe have offices in different locations India, Dallas, and Manchester that work towards a common goal for developing WSO software. We are closely working with the business to align the product with business requirements.\n\nThe Impact:\nThis is a great time to be joining a truly global team on a great technology journey. This is a great product covering multi-asset classes in both a pre/post-trade capacity with real-time reporting functionality.\nIf you want to be an integral part of this forward-thinking team with a drive to succeed and the opportunity to enhance your career development and expand your technical skill sets, then this is the role for you.\nYour challenge will be reducing the time to market for products without compromising quality by using innovation and technical skills.\n\nResponsibilities:\nPlay a key role in the development team to build high-quality, high-performance code.\nParticipate in the complete SDLC process (design, development, and support) of tech solutions.\nWork collaboratively with business partners to understand and clarify requirements.\nCollaborate effectively with technical and non-technical stakeholders.\nDesign and develop industry-leading applications.\nActively participate in the production issues resolutions.\n\nBasic Qualifications:\nBachelor's/master's degree in computer science and/or certified development program.\n\n",
    "applyLink": "https://careers.spglobal.com/jobs/314177?lang=en-us&utm_source=linkedin",
    "postingDate": "2025-04-13"
  },
  {
    "id": "5",
    "company": "Accenture",
    "title": "Software Configuration Engineer",
    "description": " Implement the configuration management plan as directed by the Configuration Lead. Assist in the design of software configuration and customization to meet the business process design and application requirements.",
    "fullDescription": "Project Role : Software Configuration Engineer\n\nProject Role Description : Implement the configuration management plan as directed by the Configuration Lead. Assist in the design of software configuration and customization to meet the business process design and application requirements.\n\nMust have skills : Python (Programming Language)\n\nGood to have skills : NA\n\nMinimum 0-2 year(s) of experience is required\n\nEducational Qualification : 15 years full time education\n\nSummary: As a Software Configuration Engineer, you will be responsible for implementing the configuration management plan as directed by the Configuration Lead. You will also assist in the design of software configuration and customization to meet the business process design and application requirements. Your typical day will involve collaborating with team members to ensure smooth software configuration processes and customization. Roles & Responsibilities: - Expected to build knowledge and support the team. - Participate in Problem Solving discussions. - Assist in the design of software configuration and customization. - Implement the configuration management plan as directed by the Configuration Lead. - Collaborate with team members to ensure smooth software configuration processes. - Support the team in resolving configuration-related issues. - Contribute to the improvement of software configuration processes. - Provide input on software customization to meet business requirements. Professional & Technical Skills: - Must To Have Skills: Proficiency in Python (Programming Language). - Strong understanding of software configuration management principles. - Experience with version control systems like Git. - Knowledge of software development lifecycle. - Familiarity with software customization techniques. Additional Information: - The candidate should have a minimum of 0-2 years of experience in Python (Programming Language). - This position is based at our Bengaluru office. - A 15 years full-time education is required.",
    "image": "images/Accenture.jpg",
    "applyLink": "https://www.accenture.com/in-en/careers/jobdetails?id=ATCI-4824600-S1849878_en&title=Software+Configuration+Engineer",
    "postingDate": "2025-05-17"
  }
]