[
  {
    "id": "1",
    "image": "oracle.png",
    "company": "Oracle",
    "title": "Associate Software Engineer",
    "description": "Associate Software Engineer || Product Development",
    "fullDescription": "Job Description\n\nThe Software Engineer is a contractually committed role to supporting AMS Custom Reporting and plays a crucial role in addressing clients' patient safety and financial revenue issues. Responsibilities encompass developing and modifying CCL scripts, participating in code reviews, collaborating on technical designs, and overseeing the debugging and documentation process. Aligned with Professional Services & Support, this role is essential for meeting AMS clients' contractual obligations, ensuring associates' alignment with clients, and contributing to overall client satisfaction.\n\nWe are looking for 1+ years of experience. Primarily the work effort would be around SQL and CCL, adding to deliverables. In addition to coding the expectations are that the candidate would be part of Code reviews, SME group and also working on making the current processes more efficient. \n\nThe candidate should be open to support our clients over On call if required.\n\nCareer Level - IC2\n\nResponsibilities\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\nRequired Skills\n\nPatient Safety\n\nSQL (Structured Query Language)\n\nAbout Us\n\nAs a world leader in cloud solutions, Oracle uses tomorrow’s technology to tackle today’s challenges. We’ve partnered with industry-leaders in almost every sector—and continue to thrive after 40+ years of change by operating with integrity. \n\nWe know that true innovation starts when everyone is empowered to contribute. That’s why we’re committed to growing an inclusive workforce that promotes opportunities for all.\n\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer competitive benefits based on parity and consistency and support our people with flexible medical, life insurance, and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\n\nWe’re committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by emailing accommodation-request_mb@oracle.com or by calling +1 888 404 2494 in the United States.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans’ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law. ",
    "applyLink": "https://eeho.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/jobsearch/job/250545",
    "postingDate": "2025-03-30"
  }
]
