[
  {
    "id": "1",
    "image": "oracle.png",
    "company": "Oracle",
    "title": "Associate Software Engineer",
    "description": "Associate Software Engineer || Product Development",
    "fullDescription": "The Software Engineer is a contractually committed role to supporting AMS Custom Reporting and plays a crucial role in addressing clients' patient safety and financial revenue issues. Responsibilities encompass developing and modifying CCL scripts, participating in code reviews, collaborating on technical designs, and overseeing the debugging and documentation process. Aligned with Professional Services & Support, this role is essential for meeting AMS clients' contractual obligations, ensuring associates' alignment with clients, and contributing to overall client satisfaction.\n\nWe are looking for 1+ years of experience. Primarily the work effort would be around SQL and CCL, adding to deliverables. In addition to coding the expectations are that the candidate would be part of Code reviews, SME group and also working on making the current processes more efficient. \n\nThe candidate should be open to support our clients over On call if required.\n\nCareer Level - IC2\n\n**Responsibilities**\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\n**Required Skills**\n\nPatient Safety\n\nSQL (Structured Query Language)\n\n**About Us**\n\nAs a world leader in cloud solutions, Oracle uses tomorrowâs technology to tackle todayâs challenges. Weâve partnered with industry-leaders in almost every sectorâand continue to thrive after 40+ years of change by operating with integrity. \n\nWe know that true innovation starts when everyone is empowered to contribute. Thatâs why weâre committed to growing an inclusive workforce that promotes opportunities for all.\n\nOracle careers open the door to global opportunities where work-life balance flourishes. We offer competitive benefits based on parity and consistency and support our people with flexible medical, life insurance, and retirement options. We also encourage employees to give back to their communities through our volunteer programs.\n\nWeâre committed to including people with disabilities at all stages of the employment process. If you require accessibility assistance or accommodation for a disability at any point, let us know by emailing accommodation-request_mb@oracle.com or by calling +1 888 404 2494 in the United States.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veteransâ status, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law. ",
    "applyLink": "https://eeho.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/jobsearch/job/250545",
    "postingDate": "2025-03-30"
  },
  {
    "id": "2",
    "image": "images/cognizant.png",
    "company": "Cognizant",
    "title": "GenC Next, GenC Pro & GenC",
    "description": "GenC Next, GenC Pro & GenC",
    "fullDescription": "**GenC - Job description:**\n\nUnderstand business requirements, raise clarifications, create documents\nDevelop, maintain, test, debug and deploy code as per the requirement specifications\nUnderstand the data requirements and develop test scenarios\nUnderstand the Agile application development environment, deliverables due and follow the SDLC\nCreate low level design for components\nIdentify and prioritize tasks to meet deadlines. Proactively address issues and work on mitigating points of failure\nTake ownership to deliver on goals specified in a timely and efficient manner\nParticipate as a member of project team in meetings and technical sessions to develop reliable, cost effective and high-quality solutions\nContinuously upskill/reskill and cross skill to scale up to new technologies\nPossess excellent communication skills.\nAbility to work collaboratively in a team environment.\n**Eligibility criteria**\n\n2024 batch of specific B.E / B.Tech / M.E / M. Tech (Streams such as Leather technology, Food technology, Fashion technology, etc. are excluded).\nStudents should possess consistent academic record with minimum 60% in X, XII, Diploma, UG & PG (rounding off 59.9% is not allowed)\nAt the time of joining, all recruits need to have a minimum 60% aggregate in the pursuing degree with no standing arrears\nAppropriate CGPA to % conversion to be considered as per university norms\nStudents with standing arrears are NOT eligible.\nFlexibility to work from any Cognizant office location in a given shift timing and technology is mandatory.\nOpen to Indian nationals / OCIs / PIOs who are currently residing in India.\nStudents will get the communications only to the registered mail ID in Superset. It must be their personal mail ID and shall be considered as the primary email ID. This email ID should not be changed at any point during hiring process or until Full Time Employment (FTE) onboarding.\n**Mandatory documents for registration:**\n\nResume attached with latest passport size photograph.\nIndustry accredited certificate if available to be uploaded mandatorily.\nMandatory documents for interview:\n\nAll academic documents including the college ID card (if available), school / college, UG and PG marksheets, provisional/ degree certificate.\nMandatory documents for onboarding:\n\nPAN card. It is a mandatory requirement for onboarding. Please ensure that your last name, father's name, and other details are accurate. Please note that background verification will fail if the last name is not updated or if the PAN card name does not match the registered name.\nVoter Id card / Passport will be mandatory to verify citizenship.\n**GenC Next** - Students should be technically proficient, with advanced programming, matured coding skills and full stack abilities with Industry accredited certificate/s in one or more: Java, C#, Web technologies (HTML, CSS, Javascript), Python, Oracle, SQL/PLSQL, Cloud (AWS, Azure and GCP),Data Structures and Algorithms, Object Oriented Programming, Maven, Spring Core, Spring Boot, Spring Data JPA, Spring REST, Data Structures and Algorithms, Object Oriented Programming, Advanced Python, Advanced Cloud Fundamentals, ASP .Net Core, SQL Server,  Entity framework Core, ASP .Net Core Web API.\n\n**GenC Pro** - Students should be technically proficient with expertise in enterprise platforms/products/specific technologies, such as Cybersecurity, Oracle, Salesforce, Mulesoft, Pega, SAP ABAP, SAP Basis and ServiceNow with Industry accredited certificate.\n\nNote: All shortlisted candidates will be notified on the hiring category for interview. Final decision on candidate screening, eligibility for assessments, interview and final selection will be at the sole discretion of Cognizant. \n\n**Disclaimer:**\n\nCognizant does not entertain payments of any kind from candidates or vendors for employment. Requests for such payments should be promptly reported to GenCHRComplianceIND@cognizant.com\nIf you encounter anyone who claims to offer jobs at Cognizant in return for any benefit (monetary or non-monetary), please do not entertain them. Please be informed that Cognizant shall not be held responsible for any such instances or payments you make\nWe recommend that you do not respond to spam emails/ messages you do not trust; never disclose your personal or financial details to anyone you do not know. If any such mails purporting to come from Cognizant are received, we advise you to contact us at GenCHRComplianceIND@cognizant.com\nCognizant takes its hiring practices seriously and appreciates you keeping the Company informed of any individuals posing as Cognizant employees who make false job offers using Cognizant’s name. We remind you that while recruiting employees, Cognizant will only communicate with you through authentic Cognizant email addresses and Cognizant will never extend any job offers to anyone based on an online application without first conducting an in-person, video, or telephone interview through verified encrypted channels\nTo ascertain that you are receiving a genuine call from Cognizant, please ensure to collect the recruiter’s details (full name; official email id, employee ID & mobile number) during the call",
    "applyLink": "https://app.joinsuperset.com/join/#/signup/student/jobprofiles/80927bc8-841c-4055-a89d-e207fdb67bd9",
    "postingDate": "2025-04-01"
  }
]